BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуПартийЗерна/ИНАГРО_ДанныеПоКачествуПартийЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИНАГРО_ДанныеПоКачествуПартийЗерна</name>
  <attributes>
    <name>НачальныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВывозОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуПартийЗерна/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Если Не Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("НачальныеДанные")).Значение Тогда
		УдалитьЛишниеОбласти(ДокументРезультат, "Начальные данные",3);
		УдалитьЛишниеОбласти(ДокументРезультат, "Початкові дані",3);
	КонецЕсли;
	
	Если Не Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("ТекущиеДанные")).Значение Тогда
		УдалитьЛишниеОбласти(ДокументРезультат, "Текущие данные",2);
		УдалитьЛишниеОбласти(ДокументРезультат, "Поточні дані",2);
	КонецЕсли; 
	
	Если Не Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("ИтоговыеДанные")).Значение Тогда
		УдалитьЛишниеОбласти(ДокументРезультат, "Итоговые данные",2);
		УдалитьЛишниеОбласти(ДокументРезультат, "Ітогові дані",2);
	КонецЕсли; 
	
	Если Не Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("ВывозОстаток")).Значение Тогда
		УдалитьЛишниеОбласти(ДокументРезультат, "Вывезено",1);
		УдалитьЛишниеОбласти(ДокументРезультат, "Вивезено",1);
		УдалитьЛишниеОбласти(ДокументРезультат, "Остаток",1);
		УдалитьЛишниеОбласти(ДокументРезультат, "Залишок",1);
	КонецЕсли; 
	
	Если Не Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("Услуги")).Значение Тогда
		УдалитьЛишниеОбласти(ДокументРезультат, "Услуги",2);
		УдалитьЛишниеОбласти(ДокументРезультат, "Послуги",2);
	КонецЕсли;
	
	ПереименоватьВывод(ДокументРезультат,"Выставлено",НСтр("ru='Выставлено';uk='Виставлено'"));
	
КонецПроцедуры

Процедура УдалитьЛишниеОбласти(ТабДок,НазваниеОбласти,КоличествоУдаляемыхКолонок)  
		
	Если НазваниеОбласти = "Услуги" Или НазваниеОбласти = "Послуги" Тогда
		ПрибавкаКОбласти = 0;
	Иначе
		ПрибавкаКОбласти = 2;
	КонецЕсли;
	
	Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл
		
		НачальнаяКолонка = 0;
		КолонкаДляУдаления = 0;
		Для индКол=1 По ТабДок.ШиринаТаблицы  Цикл
			
			Если ТабДок.Область(индСтр, индКол).Текст = НазваниеОбласти Тогда
				
				УдаляемаяОбласть1 = ТабДок.Область(индСтр, индКол, индСтр + ПрибавкаКОбласти, индКол + КоличествоУдаляемыхКолонок - 1);
				ТабДок.УдалитьОбласть(УдаляемаяОбласть1, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				КолонкаДляУдаления = индКол;
				
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ КолонкаДляУдаления = 0 Тогда
			Прервать;	
		КонецЕсли; 
	КонецЦикла;
	
	Если Не КолонкаДляУдаления = 0 Тогда 
		УдаляемаяОбласть2 = ТабДок.Область(индСтр + ПрибавкаКОбласти + 1, индКол, ТабДок.ВысотаТаблицы, индКол + КоличествоУдаляемыхКолонок - 1);	
		ТабДок.УдалитьОбласть(УдаляемаяОбласть2, ТипСмещенияТабличногоДокумента.ПоГоризонтали);	
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПереименоватьВывод(ТабДок,СтрокаПоиска,СтрокаЗамены)  
			
	Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл
		Для индКол=1 По ТабДок.ШиринаТаблицы  Цикл
			Если ТабДок.Область(индСтр, индКол).Текст = СтрокаПоиска Тогда				
				ТабДок.Область(индСтр, индКол).Текст = СтрокаЗамены;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
